// В этой программе демонстрируется отличие
// модификаторов public и private
class Test {
    int a;          // доступ, опеределенный по умолчанию
    public int b;   // открытый доступ
    private int c;  // закрытый доступ
    
    // Методы доступа к члену с данного класса 
    void setc(int i) {
        // Установление значение члена с данного класса
        c = i;
    }
    int getc() {
        // Получение значение члена с данного класса
        return c;
    }
}

public class AccessTest {
    public static void main(String args[]) {
        Test ob = new Test();
        
        // Эти операторы правильны, поэтому члены a и b
        // данного класса доступны непосредственно
        ob.a = 10;
        ob.b = 20;
        
        // Этот оператор неверен и может вызвать ошибку
        // ob.c = 100; // ОШИБКА!
        
        // Доступ к члену с данного класса должен
        // осуществляться с помощью методов его класса
        ob.setc(100); // ВЕРНО!
        System.out.println("a, b и c: " + ob.a + " " + ob.b + " " + ob.getc());
    }
}
